Terraform plan for __dev__
<details>
  <summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_dns_managed_zone.private-dns-managed-zone will be created
  + resource "google_dns_managed_zone" "private-dns-managed-zone" {
      + description   = "Private DNS zone for ebo-dev"
      + dns_name      = "commerce.internal."
      + force_destroy = false
      + id            = (known after apply)
      + name          = "ebo-dev-private-dns-managed-zone"
      + name_servers  = (known after apply)
      + project       = (known after apply)
      + visibility    = "private"

      + private_visibility_config {
          + networks {
              + network_url = "https://www.googleapis.com/compute/v1/projects/ebo-dev-321910/global/networks/ebo-dev-network"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [Terraform #13](https://github.com/ebomart/commerce-infrastructure/actions/runs/1147061086)